---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentsRepresentation
source: html/53c80d19-4e8a-db59-85df-0abc0f142331.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentsRepresentation Property

Identifies how the bending detail will represent the segments of the bar.

## Syntax (C#)
```csharp
public BendingDetailSegmentsRepresentation SegmentsRepresentation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration